app/Cells/ArtikelKategori.php

SELECT DISTINCT `kategori`
FROM `artikel`
---
    public function render(array $params = []): string
    {
        $model = new ArtikelModel();
        $kategoriList = $model->select('kategori')->distinct()->findAll();