app/Controllers/Artikel.php

SELECT *
FROM `artikel`
WHERE `judul` LIKE '%the rise%' ESCAPE '!'
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%the rise%' ESCAPE '!'
---
    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $q = $this->request->getVar('q') ?? '';
        $model = new ArtikelModel();

        $artikel = $model->like('judul', $q)->paginate(4);

SELECT *
FROM `artikel`
WHERE `id` = '22'
 LIMIT 1
---
    public function edit($id)
    {
        $artikel = new ArtikelModel();

        $validation = \Config\Services::validation();
        $validation->setRules(['judul' => 'required']);
        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid) {
            $artikel->update($id, [
                'judul' => $this->request->getPost('judul'),
                'kategori' => $this->request->getPost('kategori'),
                'isi'   => $this->request->getPost('isi'),
            ]);
            return redirect()->to('admin');
        }

        $data = $artikel->where('id', $id)->first();