app/Controllers/Home.php

    public function index(): string
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();
        $artikel = $model->findAll();
---
SELECT *
FROM `artikel`