app/Controllers/Page.php

    public function artikel($slug)
    {
        $model = new ArtikelModel();
        $artikel = $model->where('slug', $slug)->first();
---
SELECT *
FROM `artikel`
WHERE `slug` = 'Boost-Your-PHP-Projects-Performance-with-Memcached'
 LIMIT 1